handsOn/flowOverCylinder/snappyHexMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.0001;
        maxIter			100;
        smoother        DIC;
        nPreSweeps      1;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection	true;
        directSolveCoarsestLevel	false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 330;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }
    
    /*U
    {
        type            coupled;
        solver          PBiCICG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
    }*/
    
    UFinal
    {
        $U;
    }
    
    "(k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }
    
    /*"(k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }*/

    "(k|epsilon|omega)Final"
    {
        $k;
        relTol          0;
    }
    
    
    Phi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.001;
    }
}

PIMPLE
{
    nOuterCorrectors    10;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    
    turbOnFinalIterOnly	false;
    
    residualControl
    {
        "(U|k|epsilon)"
        {
            relTol          0;
            tolerance       0.00001;
        }
    }
}

relaxationFactors
{
    /*equations
    {
        "(k|epsilon|omega)"		0.6;
        p						0.4;
        U						0.6;		
    }*/
}

potentialFlow
{
    nNonOrthogonalCorrectors 20;
}

// ************************************************************************* //
