handsOn/flowOverCylinder/snappyHexMesh/Allrun
#!/bin/bash
#
# run the case

./meshIt

./run

./post
